In [14]:
import pandas as pd 

df = pd.read_csv("students.csv")
print(df.loc[4])
print(df.iloc[1,2])
print(df.at[2, 'Math'])
print(df.iat[2,1])
df['average'] = ((df['Math'] + df['Science'] + df['English']) / 3).round(2)
print(f"{average.round(2)}")
filtered_data = df.query('average > 85')
filtered_data

Name       Elina
Math          78
Science       82
English       75
Grade         11
Name: 4, dtype: object
85
95
95
0    88.33
1    80.33
2    91.67
3    61.67
4    78.33
dtype: float64

    Name   Math  Science  English  Grade  average
0  Aayush    88       92       85     11    88.33
2  Chiran    95       91       89     12    91.67